In [21]:
import os

os.makedirs(os.path.join("..","csv"),exist_ok=True)
filePath=os.path.join("..","csv","test.csv")
with open(filePath,mode="w",encoding="utf-8") as f:
    f.write("name,money\n")
    f.write("Alan,22222222\n")
    f.write("Peter,33333333\n")
    f.write("Jack,NA\n")
type(filePath)

str

In [12]:
import pandas
data = pandas.read_csv(filePath)
data

    name       money
0   Alan  22222222.0
1  Peter  33333333.0
2   Jack         NaN

In [14]:
m=data.iloc[:,1]

0    22222222.0
1    33333333.0
2           NaN
Name: money, dtype: float64

In [15]:
m = data.iloc[:,1]
m = m.fillna(m.mean())
m

0    22222222.0
1    33333333.0
2    27777777.5
Name: money, dtype: float64

In [16]:
type(m)

pandas.core.series.Series

In [17]:
type(m.values)

numpy.ndarray

In [20]:
import torch
torch.tensor(m.values)

tensor([22222222.0000, 33333333.0000, 27777777.5000], dtype=torch.float64)

In [22]:
with open('../csv/test.csv') as f:
    while True:
        line = f.readline()
        print(line)
        if not line:
            break

name,money

Alan,22222222

Peter,33333333

Jack,NA

In [29]:
filePath='../csv/test2.csv'
os.makedirs(os.path.dirname(filePath),exist_ok=True)
with open('../csv/test2.csv',mode='w') as f:
    f.write("name,room,money,age\n")
    f.write("Alan,A1,100000,NA\n")
    f.write("Peter,B1,NA,18\n")
    f.write("Jack,NA,NA,30\n")

In [30]:
import pandas
csv=pandas.read_csv(filePath)

In [31]:
dummies = pandas.get_dummies(csv,dummy_na=True)
dummies

,money,age,name_Alan,name_Jack,name_Peter,name_nan,room_A1,room_B1,room_nan
0,100000.0,NaN,True,False,False,False,True,False,False
1,NaN,18.0,False,False,True,False,False,True,False
2,NaN,30.0,False,True,False,False,False,False,True

In [47]:
csv.isna().sum()

name     0
room     1
money    2
age      1
dtype: int64

In [51]:
csv2=csv.drop(columns=[csv.isna().sum().idxmax()])
csv,csv2

(    name room     money   age
 0   Alan   A1  100000.0   NaN
 1  Peter   B1       NaN  18.0
 2   Jack  NaN       NaN  30.0,
     name room   age
 0   Alan   A1   NaN
 1  Peter   B1  18.0
 2   Jack  NaN  30.0)

In [65]:
dummies=pandas.get_dummies(csv2,dummy_na=True,dtype=int)
dummies

,age,name_Alan,name_Jack,name_Peter,name_nan,room_A1,room_B1,room_nan
0,NaN,1,0,0,0,1,0,0
1,18.0,0,0,1,0,0,1,0
2,30.0,0,1,0,0,0,0,1

In [67]:
dummies=dummies.fillna(0)
torch.tensor(dummies.values)

tensor([[ 0.,  1.,  0.,  0.,  0.,  1.,  0.,  0.],
        [18.,  0.,  0.,  1.,  0.,  0.,  1.,  0.],
        [30.,  0.,  1.,  0.,  0.,  0.,  0.,  1.]], dtype=torch.float64)